## Estadística Aplicada

Sesión 3 - 15 ago

Karla Mariana Ley Acero 2076201

Grupo 42

**DICCIONARIOS** = {}

**TUPLAS** = ()

**LISTAS** = []

## **Tuplas**

Es una colección de objetos inmutable (no se puede cambiar, quitar o añadir elementos)

In [1]:
tupla_alumno = ('Juan', 'Perez', 17)

In [2]:
type(tupla_alumno)

tuple

In [5]:
# tupla_alumno.remove('Juan')

# Lo de arriba marca error porque es una tupla

## Diccionarios (mapeo de valores)

clave(variable) - valor

In [6]:
dict1_alumno = {'Nombre': 'Juan', 'Apellido': 'Perez'}

In [7]:
type(dict1_alumno)

dict

In [8]:
dic_grupo = {'Nombre': ['Jime', 'Raul', 'Ana'], 'Edad': [17, 21, 15]}

In [9]:
dic_grupo['Nombre']

#Pongo adentro la clave que quiero consultar

['Jime', 'Raul', 'Ana']

In [10]:
# ¿Como se que claves tiene el diccionario?

dic_grupo.keys()

dict_keys(['Nombre', 'Edad'])

In [11]:
# Conocer los valores

dic_grupo.values()

dict_values([['Jime', 'Raul', 'Ana'], [17, 21, 15]])

## Pandas

Nos sirve para manejar datos estructurados. Pandas esta construido sobre Numpy, todas las funciones de Numpy funcionan en Pandas.

Pandas tiene tres estructuras básicas:
1. Series (unidimensionales)
2. Dataframes (filas y columnas)
3. Panl (variables en el tiempo)

In [12]:
import pandas as pd

Suponer que conocemos la edad de las siguientes personas  :

|Pedro| 12 |
|-----|----|
|Juan | 17 |
|Jime | 21 |
|Rosa |22  |

In [13]:
edades = [12, 17, 21, 22]

In [14]:
edades

[12, 17, 21, 22]

In [16]:
#Como la serie que se acaba de crear es pandas, se utiliza pd
# Index = etiquetas 

serie_edades = pd.Series(edades, index = {'Pedro', 'Juan', 'Jime', 'Rosa'})

In [17]:
type(serie_edades)

pandas.core.series.Series

In [18]:
serie_edades

Jime     12
Juan     17
Pedro    21
Rosa     22
dtype: int64

In [21]:
#Como podemos calcular con las funciones de Numpye
serie_edades.mean()

18.0

In [22]:
serie_edades.median()

19.0

## **Dataframe**

Datos en filas y columnas

In [23]:
alumno1 = ['Juan', 'Perez', 23]
alumno2 = ['Raul', 'Gonzalez', 17]
alumno3 = ['Jimena', 'Rosas', 20]
alumno4 = ['Alejandra', 'Saldaña', 21]

In [24]:
#Crear una lista conformada por listas
grupo_estadistica = [alumno1, alumno2, alumno3, alumno4]

In [25]:
grupo_estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzalez', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [28]:
# Convertirlo en Dataframe con Pandas

df_clase = pd.DataFrame(grupo_estadistica, columns = ['Nombre', 'Apellido', 'Edad'])

In [31]:
type(df_clase)

pandas.core.frame.DataFrame

In [29]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzalez    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [32]:
#Regresar el nombre de las columnas
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [33]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
#Agregar una columna
df_clase['Municipio'] = ['Monterrey', 'Escobedo', 'Apodaca', 'Santiago']

In [35]:
df_clase

      Nombre  Apellido  Edad  Municipio
0       Juan     Perez    23  Monterrey
1       Raul  Gonzalez    17   Escobedo
2     Jimena     Rosas    20    Apodaca
3  Alejandra   Saldaña    21   Santiago

In [37]:
#Añadir columna que será edad en días

df_clase ['Edad en días'] = df_clase['Edad'] *365

In [38]:
df_clase

      Nombre  Apellido  Edad  Municipio  Edad en días
0       Juan     Perez    23  Monterrey          8395
1       Raul  Gonzalez    17   Escobedo          6205
2     Jimena     Rosas    20    Apodaca          7300
3  Alejandra   Saldaña    21   Santiago          7665

## **Seleccionar elementos de un dataframe**

1. Selecc Estándar
2. Selección por .iloc
3. Selección por .loc
4. Selección condicional

##### **SELECCIÓN ESTÁNDAR**

In [39]:
#Nombre de DataFrame (la columna que queremos seleccionar)

df_clase['Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [40]:
## Seleccionar dos columnas, dos objetos (una lista)

df_clase[['Edad', 'Nombre']]

   Edad     Nombre
0    23       Juan
1    17       Raul
2    20     Jimena
3    21  Alejandra

In [41]:
# Selección estándar de filas
df_clase[0:2]

  Nombre  Apellido  Edad  Municipio  Edad en días
0   Juan     Perez    23  Monterrey          8395
1   Raul  Gonzalez    17   Escobedo          6205

In [42]:
# Combinar seleccionar filas y columnas
# Primero el rango de filas que quiero, luego las columnas
df_clase[0:2]['Edad']

0    23
1    17
Name: Edad, dtype: int64

In [44]:
df_clase[0:2][['Edad', 'Nombre']]

   Edad Nombre
0    23   Juan
1    17   Raul

## **SELECCIÓN .ILOC**

Selección por posición

*dataframe.iloc[filas,columnas]*

In [45]:
df_clase.iloc[0,2]

23

In [47]:
df_clase.iloc[0:2, 2]

0    23
1    17
Name: Edad, dtype: int64

In [ ]:
# Seleccionar todas las filas = : (no se elige ningún rango)

df_clase.iloc[ : [1,2]]

In [48]:
# Ver DataFrame

df_clase

      Nombre  Apellido  Edad  Municipio  Edad en días
0       Juan     Perez    23  Monterrey          8395
1       Raul  Gonzalez    17   Escobedo          6205
2     Jimena     Rosas    20    Apodaca          7300
3  Alejandra   Saldaña    21   Santiago          7665

In [52]:
#Convertir nombre en index, ya no se llama fila 0 ahora se llama Juan
df_clase = df_clase.set_index('Nombre')

In [54]:
df_clase

           Apellido  Edad  Municipio  Edad en días
Nombre
Juan          Perez    23  Monterrey          8395
Raul       Gonzalez    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665

In [55]:
df_clase.columns

Index(['Apellido', 'Edad', 'Municipio', 'Edad en días'], dtype='object')

In [56]:
df_clase.index

Index(['Juan', 'Raul', 'Jimena', 'Alejandra'], dtype='object', name='Nombre')

## **SELECCIÓN POR .LOC**

Selección por etiquetas (nombres)

*df_clase.loc[nombre filas, nombre columnas]*

In [57]:
df_clase.loc[:, 'Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [58]:
#Si queremos la edad de Juan
df_clase.loc['Juan', 'Edad']

23

In [59]:
## Selección por SQL (nombre de la tabla.nombre columna)

df_clase.Edad

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

## **SELECCIÓN POR CONDICIONAL**

In [60]:
df_clase

           Apellido  Edad  Municipio  Edad en días
Nombre
Juan          Perez    23  Monterrey          8395
Raul       Gonzalez    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665

In [61]:
#Seleccionar los que tienen una edad mayor o igual a 18
#Seleccionar columna edad, decir donde se encuentra, en este caso en df clase en una columna que se llama Edad

df_clase[df_clase['Edad']>=18]

          Apellido  Edad  Municipio  Edad en días
Nombre
Juan         Perez    23  Monterrey          8395
Jimena       Rosas    20    Apodaca          7300
Alejandra  Saldaña    21   Santiago          7665

In [62]:
df_clase[df_clase['Municipio'] == 'Apodaca']

       Apellido  Edad Municipio  Edad en días
Nombre
Jimena    Rosas    20   Apodaca          7300

In [65]:
# Ordenamiento

# Ordenar por edad

df_clase.sort_values('Edad')

           Apellido  Edad  Municipio  Edad en días
Nombre
Raul       Gonzalez    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665
Juan          Perez    23  Monterrey          8395

In [66]:
#Ordenar por nombre

df_clase.sort_values('Nombre')

           Apellido  Edad  Municipio  Edad en días
Nombre
Alejandra   Saldaña    21   Santiago          7665
Jimena        Rosas    20    Apodaca          7300
Juan          Perez    23  Monterrey          8395
Raul       Gonzalez    17   Escobedo          6205

In [67]:
#Ordenar de  mayor a menor 

df_clase.sort_values('Edad', ascending = False)

           Apellido  Edad  Municipio  Edad en días
Nombre
Juan          Perez    23  Monterrey          8395
Alejandra   Saldaña    21   Santiago          7665
Jimena        Rosas    20    Apodaca          7300
Raul       Gonzalez    17   Escobedo          6205

*Sort.values nos permite ordenar por varias variables*

In [68]:
df_clase.sort_values(['Edad', 'Apellido'])

# Ordena por edad, puede que algunos tengan la misma, en ese caso van a aparecer ordenados por apellidos

           Apellido  Edad  Municipio  Edad en días
Nombre
Raul       Gonzalez    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665
Juan          Perez    23  Monterrey          8395

### **FUNCIONES DE NUMPY**

In [69]:
df_clase['Edad'].mean()

20.25

In [71]:
df_clase['Edad'].std(ddof=1)

2.5

In [72]:
df_clase['Edad'].sum()

81

### **NP.WHERE**

Es la función IF de Excel

Se estructura igual que Excel

*np.where(condición, valor si condición cumple, valor si no cumple)*

In [73]:
import numpy as np

In [77]:
#Generar nueva columna que contenga el SI

df_clase['Mayoría de edad'] =np.where(df_clase['Edad']>=18, 'Mayor', 'Menor')

In [78]:
df_clase

           Apellido  Edad  Municipio  Edad en días Mayoría de edad
Nombre
Juan          Perez    23  Monterrey          8395           Mayor
Raul       Gonzalez    17   Escobedo          6205           Menor
Jimena        Rosas    20    Apodaca          7300           Mayor
Alejandra   Saldaña    21   Santiago          7665           Mayor

### **NP.SELECT**

Equivalente a SI.CONJUNTO de excel

Formato : *np.select(condiciones, valor condicion, valor si ninguna condicion cumple)*

In [81]:
# Calificar si las personas deberian estar en la prepa, universidad o trabajando

condiciones = [df_clase['Edad']<=17,
               df_clase['Edad']<23,
               df_clase['Edad']>=23]

valores = ['Prepa', 'Universidad', 'Trabajando']

#Crea columna que se llame situación

df_clase['Situación'] = np.select(condiciones, valores, default = 'Inválido')

In [82]:
df_clase

,Apellido,Edad,Municipio,Edad en días,Mayoría de edad,Situación
Nombre,,,,,,
Juan,Perez,23,Monterrey,8395,Mayor,Trabajando
Raul,Gonzalez,17,Escobedo,6205,Menor,Prepa
Jimena,Rosas,20,Apodaca,7300,Mayor,Universidad
Alejandra,Saldaña,21,Santiago,7665,Mayor,Universidad

In [83]:
# Vamos a contar cuantas personas hay en edad

df_clase.count()

Apellido           4
Edad               4
Municipio          4
Edad en días       4
Mayoría de edad    4
Situación          4
dtype: int64

In [84]:
df_clase['Edad'].count()

4

In [85]:
#Cuantas personas son mayor de edad y cuantos son menor de edad

df_clase.value_counts('Mayoría de edad')

Mayoría de edad
Mayor    3
Menor    1
Name: count, dtype: int64

In [91]:
#Promedio de edad de los mayores y los menores

#groupby (donde los tenemos diferenciados)

df_clase.groupby('Mayoría de edad').mean(numeric_only =  True).round(1)['Edad']

Mayoría de edad
Mayor    21.3
Menor    17.0
Name: Edad, dtype: float64

In [92]:
# Aggregate agg

# Para resumir

df_clase.agg('count')

Apellido           4
Edad               4
Municipio          4
Edad en días       4
Mayoría de edad    4
Situación          4
dtype: int64

In [97]:
#Primero los agrupo por mayoria de edad, luego de la variable de la que quiero los calculos, despues que calculos quiero

#Si quiero varios calculos ahora se convierte en una lista ([])

#Un calculo = ()
df_clase.groupby('Mayoría de edad')['Edad'].agg(['mean', 'std']).round(1)

                 mean  std
Mayoría de edad
Mayor            21.3  1.5
Menor            17.0  NaN

<!-- ## IMPORTAR DATAFRANES -->

## IMPORTAR UN DATAFRAME

In [124]:
calificaciones = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [125]:
calificaciones

    Id            Nombre   Apellido  Calficación Final
0    1           ANTONIO     GARCIA                 73
1    2            MANUEL  FERNANDEZ                 19
2    3              JOSE   GONZALEZ                 38
3    4             DAVID      PEREZ                 14
4    5              JUAN      LOPEZ                 99
5    6      JOSE ANTONIO  RODRIGUEZ                 66
6    7            JAVIER    SANCHEZ                 46
7    8         JOSE LUIS      GOMEZ                 89
8    9  FRANCISCO JAVIER    JIMENEZ                 10
9   10            CARLOS       RUIZ                 62
10  11             JESUS     ALONSO                 94
11  12         ALEJANDRO  HERNANDEZ                 17
12  13            MIGUEL       DIAZ                 85
13  14       JOSE MANUEL  GUTIERREZ                 34
14  15            RAFAEL    ALVAREZ                 86
15  16      MIGUEL ANGEL     MORENO                100
16  17             PEDRO      MUÑOZ                  1
17  18             PABLO     BLANCO                 64
18  19             ANGEL        GIL                100
19  20            SERGIO    AGUIRRE                  2
20  21        JOSE MARIA       DIEZ                 29
21  22          FERNANDO    SALAZAR                 51
22  23             JORGE      RAMOS                 76
23  24              LUIS  DOMINGUEZ                 12
24  25           ALBERTO      ORTIZ                 99
25  26       JUAN CARLOS     IBAÑEZ                 43
26  27            ALVARO    RAMIREZ                 40
27  28            ADRIAN       SAEZ                  7

In [126]:
#Evitar abrir todas las observaciones y solo las primeras

calificaciones.head()

   Id   Nombre   Apellido  Calficación Final
0   1  ANTONIO     GARCIA                 73
1   2   MANUEL  FERNANDEZ                 19
2   3     JOSE   GONZALEZ                 38
3   4    DAVID      PEREZ                 14
4   5     JUAN      LOPEZ                 99

In [127]:
#Para ver el final

calificaciones.tail()

    Id       Nombre   Apellido  Calficación Final
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [128]:
calificaciones.info()

#En este caso index (filas) =28

#Columnas = 4 
#Object =string

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 28 non-null     int64
 1   Nombre             28 non-null     object
 2   Apellido           28 non-null     object
 3   Calficación Final  28 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.0+ KB

In [129]:
# Para ver filas y columnas

calificaciones.shape

(28, 4)

In [130]:
# ESTADÍSTICAS DESCRIPTIVAS

calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [131]:
#Corregir el nombre de Calificacion final

#Nombre lo cambiamos por un diccionario, por eso va en {}, primero viejo, luego nuevo

calificaciones = calificaciones.rename(columns = {'Calficación Final' : 'CalFinal'})

In [132]:
calificaciones

    Id            Nombre   Apellido  CalFinal
0    1           ANTONIO     GARCIA        73
1    2            MANUEL  FERNANDEZ        19
2    3              JOSE   GONZALEZ        38
3    4             DAVID      PEREZ        14
4    5              JUAN      LOPEZ        99
5    6      JOSE ANTONIO  RODRIGUEZ        66
6    7            JAVIER    SANCHEZ        46
7    8         JOSE LUIS      GOMEZ        89
8    9  FRANCISCO JAVIER    JIMENEZ        10
9   10            CARLOS       RUIZ        62
10  11             JESUS     ALONSO        94
11  12         ALEJANDRO  HERNANDEZ        17
12  13            MIGUEL       DIAZ        85
13  14       JOSE MANUEL  GUTIERREZ        34
14  15            RAFAEL    ALVAREZ        86
15  16      MIGUEL ANGEL     MORENO       100
16  17             PEDRO      MUÑOZ         1
17  18             PABLO     BLANCO        64
18  19             ANGEL        GIL       100
19  20            SERGIO    AGUIRRE         2
20  21        JOSE MARIA       DIEZ        29
21  22          FERNANDO    SALAZAR        51
22  23             JORGE      RAMOS        76
23  24              LUIS  DOMINGUEZ        12
24  25           ALBERTO      ORTIZ        99
25  26       JUAN CARLOS     IBAÑEZ        43
26  27            ALVARO    RAMIREZ        40
27  28            ADRIAN       SAEZ         7

In [133]:
# Eliminar columna ID, nos apoyamos de loc

calificaciones = calificaciones.loc[:, calificaciones.columns != 'Id']

Realiza lo siguiente:

1. Sacar el promedio de las calificaciones

2. Crear nueva columna llamada 'Situación' donde si es mayor o iguala 70 el alumno esta aprovado, si no esta reprobado

3. Numero de aprobados, numero de reprobados

4. Promedio de reprobados y aprobados

In [134]:
calificaciones['CalFinal'].mean()

52.0

In [135]:
calificaciones['Situación'] = np.where(calificaciones['CalFinal']>=70, 'Aprobado', 'Reprobado')

In [136]:
calificaciones

              Nombre   Apellido  CalFinal  Situación
0            ANTONIO     GARCIA        73   Aprobado
1             MANUEL  FERNANDEZ        19  Reprobado
2               JOSE   GONZALEZ        38  Reprobado
3              DAVID      PEREZ        14  Reprobado
4               JUAN      LOPEZ        99   Aprobado
5       JOSE ANTONIO  RODRIGUEZ        66  Reprobado
6             JAVIER    SANCHEZ        46  Reprobado
7          JOSE LUIS      GOMEZ        89   Aprobado
8   FRANCISCO JAVIER    JIMENEZ        10  Reprobado
9             CARLOS       RUIZ        62  Reprobado
10             JESUS     ALONSO        94   Aprobado
11         ALEJANDRO  HERNANDEZ        17  Reprobado
12            MIGUEL       DIAZ        85   Aprobado
13       JOSE MANUEL  GUTIERREZ        34  Reprobado
14            RAFAEL    ALVAREZ        86   Aprobado
15      MIGUEL ANGEL     MORENO       100   Aprobado
16             PEDRO      MUÑOZ         1  Reprobado
17             PABLO     BLANCO        64  Reprobado
18             ANGEL        GIL       100   Aprobado
19            SERGIO    AGUIRRE         2  Reprobado
20        JOSE MARIA       DIEZ        29  Reprobado
21          FERNANDO    SALAZAR        51  Reprobado
22             JORGE      RAMOS        76   Aprobado
23              LUIS  DOMINGUEZ        12  Reprobado
24           ALBERTO      ORTIZ        99   Aprobado
25       JUAN CARLOS     IBAÑEZ        43  Reprobado
26            ALVARO    RAMIREZ        40  Reprobado
27            ADRIAN       SAEZ         7  Reprobado

In [137]:
calificaciones.value_counts('Situación')

Situación
Reprobado    18
Aprobado     10
Name: count, dtype: int64

In [138]:
calificaciones.groupby('Situación')['CalFinal'].agg('mean').round(2)

Situación
Aprobado     90.10
Reprobado    30.83
Name: CalFinal, dtype: float64